eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
/** @brief Displays a message on the OLED screen prompting user to connect to the WiFiManager AP. */
void displayConnectAPMessage() {
  display.clearDisplay();
  display.setTextSize(1); // Larger text size
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(0, 0);
  display.println("Connect to WiFi:");
  display.setTextSize(2);
  display.println("MiauAP");
  display.display();
}



void configModeCallback (WiFiManager *myWiFiManager) {
displayConnectAPMessage();

}

void showBongoCat(){
  display.drawBitmap(0, 0, bongocat, 128, 32, WHITE);
  display.display();
  delay(10);
  // if(digitalRead(input_left) == LOW){
    display.clearDisplay();
    display.setRotation(2);
    display.drawBitmap(0, 0, taps[0], 128, 32, WHITE);
    display.display();
    delay(300);
  // }
  // if(digitalRead(input_right) == LOW){
    display.clearDisplay();
    display.setRotation(2);
    display.drawBitmap(0, 0, taps[1], 128, 32, WHITE);
    display.display();
    delay(300);
  // }
}

/**
 * @brief Initializes the ESP32 DevKitV1 board.
 *
 * This function performs the following setup tasks:
 * - Disables the brownout detector.
 * - Initializes Serial communication (both primary and Serial2 for ESP32CAM).
 * - Generates and stores the unique device ID.
 * - Initializes I2C communication for the OLED display.
 * - Initializes the OLED display and shows a startup animation.
 * - Enables touch wakeup functionality.
 * - Loads saved configuration settings (servo limits, velocities, timezone, NTP interval, timers) from Preferences (NVS).
 * - Initializes output pins for laser and relay.
 * - Attaches and initializes servo motors to their default positions.
 * - Sets up WiFiManager for Wi-Fi connection and credential management.
 *   - If autoConnect fails, it starts a configuration portal.
 *   - On successful connection, initializes the NTP client for time synchronization.
 * - Initializes ArduinoOTA for over-the-air updates.
 * - Initializes the WebSocket client and sets up its event handler and reconnect interval.
 */
void setup() {
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); // Disable brownout detector
  Serial.begin(115200);
  deviceId = getChipId();
  Serial.println("Device ID: " + deviceId);
  Serial2.begin(115200); // Initialize Serial2
  // Initialize I2C communication
  Wire.begin(SDA_PIN, SCL_PIN);

  // Initialize OLED display
  if(!display.begin(SSD1306_SWITCHCAPVCC, 0x3C)) { // Address 0x3C for 128x32
    Serial.println(F("SSD1306 allocation failed"));
    for(;;);
  }

  // Play the tap animation 6 times at startup
  for (int i = 0; i < 3; i++) {
showBongoCat();
  }

  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(0, 0);
  display.print("Connecting to Wi-Fi..");
  display.display();

  touchSleepWakeUpEnable(T9, 75); // Enable touch wakeup


  preferences.begin("servo_config"); // Namespace for our preferences

  minX = preferences.getInt("min_x", 0); // Default to 0 if not found
  maxX = preferences.getInt("max_x", 180); // Default to 180 if not found
  minY = preferences.getInt("min_y", 45); // Default to 0 if not found
  maxY = preferences.getInt("max_y", 135); // Default to 180 if not found
  minVel = preferences.getInt("min_vel", 800); // Default to 800 if not found
  maxVel = preferences.getInt("max_vel", 2000); // Default to 2000 if not found
  timeZoneOffset = preferences.getInt("timezone", 2);  // Load timezone, default to 2
  ntpUpdateInterval = preferences.getLong("ntp_interval", 60 * 60 * 1000); // Load interval
  Serial.print("Loaded Timezone Offset (Preferences): ");
  Serial.println(timeZoneOffset);
  Serial.print("Loaded NTP Update Interval (Preferences): ");
  Serial.println(ntpUpdateInterval);

  Serial.print("Loaded Min Velocity (Preferences): ");
  Serial.println(minVel);
  Serial.print("Loaded Max Velocity (Preferences): ");
  Serial.println(maxVel);

  // Load num_timers first to know how many slots were previously saved.
  // This value might be adjusted later if some slots are found to be invalid.
  numTimeSlots = preferences.getInt("num_timers", 0);
  Serial.printf("[DEBUG] Loaded num_timers from preferences: %d\n", numTimeSlots);

  // Revised Timer Loading Logic
  int validSlotsCount = 0;
  for (int i = 0; i < MAX_TIMERS; i++) { // Iterate up to MAX_TIMERS to check all possible stored slots
      String baseKey = "timer_" + String(i);
      int startMins = preferences.getInt((baseKey + "_start").c_str(), -1);
      int stopMins = preferences.getInt((baseKey + "_stop").c_str(), -1);
      Serial.printf("[DEBUG] Slot %d: Read startMins=%d, stopMins=%d from Prefs\n", i, startMins, stopMins);

      // Enhanced validation: valid range AND non-zero duration
      if (startMins >= 0 && startMins < (24*60) &&
          stopMins >= 0 && stopMins < (24*60) &&
          startMins != stopMins) {

          // This is a valid timer slot, proceed to load/compact it
          if (validSlotsCount < i) { // Compact valid timers to the front of the array
              timeSlots[validSlotsCount].startTimeMinutes = startMins;
              timeSlots[validSlotsCount].stopTimeMinutes = stopMins;
          } else { // validSlotsCount == i
               // If we always assign to timeSlots[validSlotsCount], this branch might not be strictly needed
               // as timeSlots[i] would be timeSlots[validSlotsCount]
               timeSlots[validSlotsCount].startTimeMinutes = startMins;
               timeSlots[validSlotsCount].stopTimeMinutes = stopMins;
          }
          timeSlots[validSlotsCount].active = false; // Initialize as not active
          Serial.printf("[DEBUG] Loaded Valid Timer %d (from slot %d): Start=%d, Stop=%d\n", validSlotsCount, i, timeSlots[validSlotsCount].startTimeMinutes, timeSlots[validSlotsCount].stopTimeMinutes);
          validSlotsCount++;
      } else {
          // This timer is invalid (e.g. -1 in prefs, out of minute range, or zero duration)
          Serial.printf("[DEBUG] Invalid or zero-duration timer (Start: %d, Stop: %d) from Prefs for slot %d - Skipping.\n", startMins, stopMins, i);
          // No need to explicitly remove from preferences here if we save the compacted valid list later
          // If we compact, any old data at timeSlots[i] from a previous run will be overwritten by a valid timer
          // or left as is if no more valid timers are found.
          // If we want to ensure all non-loaded slots in timeSlots array are -1, we could explicitly set them:
          // timeSlots[i].startTimeMinutes = -1;
          // timeSlots[i].stopTimeMinutes = -1;
          // However, the loop for schedule checking only goes up to numTimeSlots.
      }
  }
  numTimeSlots = validSlotsCount; // Set numTimeSlots to the actual number of valid timers found
  Serial.printf("[DEBUG] Final numTimeSlots after loading and validation: %d\n", numTimeSlots);

  Serial.printf("[DEBUG] Saving num_timers=%d back to preferences.\n", numTimeSlots);
  preferences.putInt("num_timers", numTimeSlots); // Update the stored count of timers to reflect only valid ones found now.

  // preferences.end(); // Moved this call to after all preference reads/writes in setup if it was here.
                      // It seems preferences.begin() is called once, and end() should be at the very end of setup's preference usage.
                      // For now, assuming it's handled globally or later in setup. If not, this needs placement.
                      // The original code has preferences.begin("servo_config") and no preferences.end() in setup.
                      // This is not ideal. It should be preferences.end() after all preference operations are done for this scope.
                      // For this change, I'll assume the existing structure and only add putInt for num_timers.
                      // A full review of preference handling scope would be a separate task.

  // Set pins to output and initialize as ON
  pinMode(outputPin, OUTPUT);
  pinMode(relayPin, OUTPUT);
  turnLaserOn();
  delay(500);
  turnLaserOff();
  digitalWrite(relayPin, HIGH);
  // Calculate halfway positions
  // int initialX = (minX + maxX) / 2;
  // int initialY = (minY + maxY) / 2;
  int initialX = 90;
  int initialY = 90;

