eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
    JsonArray timersArray = config_obj.createNestedArray("timers");
    for (int i = 0; i < numTimeSlots; i++) {
        if (timeSlots[i].startTimeMinutes != -1 && timeSlots[i].stopTimeMinutes != -1) {
            JsonObject timer = timersArray.createNestedObject();
            timer["startTimeMinutes"] = timeSlots[i].startTimeMinutes;
            timer["stopTimeMinutes"] = timeSlots[i].stopTimeMinutes;
        }
    }

    String output;
    serializeJson(doc, output);

    // Existing debug logs
    Serial.println("[DEBUG] Attempting to send systemConfig via WebSocket.");
    Serial.println("JSON to send: " + output);

    bool sent = webSocket.sendTXT(output);
    if (sent) {
        Serial.println("[DEBUG] systemConfig message sent successfully to WebSocket server.");
    } else {
        Serial.println("[ERROR] Failed to send systemConfig message to WebSocket server!");
    }
}

void saveTimersToPreferences() {
  Serial.println("[DEBUG] saveTimersToPreferences called.");
  preferences.begin("servo_config", false); // Begin the session here, non-read-only

  Serial.printf("[DEBUG] Saving num_timers in saveTimersToPreferences: %d\n", numTimeSlots);
  preferences.putInt("num_timers", numTimeSlots);
  // Serial.printf("Read back num_timers: %d\n", preferences.getInt("num_timers", -99)); // Optional: Verification

  for (int i = 0; i < numTimeSlots; i++) {
    String startKey = "timer_" + String(i) + "_start";
    String stopKey = "timer_" + String(i) + "_stop";
    Serial.printf("[DEBUG] Saving timer %d to Prefs: Start=%d, Stop=%d\n", i, timeSlots[i].startTimeMinutes, timeSlots[i].stopTimeMinutes);
    preferences.putInt(startKey.c_str(), timeSlots[i].startTimeMinutes);
    // Serial.printf("Saved %s: %d\n", startKey.c_str(), timeSlots[i].startTimeMinutes);
    // Serial.printf("Read back %s: %d\n", startKey.c_str(), preferences.getInt(startKey.c_str(), -99)); // Optional

    preferences.putInt(stopKey.c_str(), timeSlots[i].stopTimeMinutes);
    // Serial.printf("Saved %s: %d\n", stopKey.c_str(), timeSlots[i].stopTimeMinutes);
    // Serial.printf("Read back %s: %d\n", stopKey.c_str(), preferences.getInt(stopKey.c_str(), -99)); // Optional
  }

  preferences.end(); // End the session here
  Serial.println("Timers saved to Preferences.");
}

void addTimeSlot(String startTimeStr, String stopTimeStr) {
  Serial.printf("[DEBUG] addTimeSlot called with startTimeStr: %s, stopTimeStr: %s\n", startTimeStr.c_str(), stopTimeStr.c_str());
  if (numTimeSlots < MAX_TIMERS) {
    int startTimeMinutes = timeToMinutes(startTimeStr);
    int stopTimeMinutes = timeToMinutes(stopTimeStr);
    Serial.printf("[DEBUG] Converted to startTimeMinutes: %d, stopTimeMinutes: %d\n", startTimeMinutes, stopTimeMinutes);

    // Enhanced validation for converted minutes, including zero-duration check
    if (startTimeMinutes == -1 || stopTimeMinutes == -1 || startTimeMinutes == stopTimeMinutes) {
        Serial.printf("[DEBUG] Invalid input or zero-duration timer provided to addTimeSlot (StartMins: %d, StopMins: %d). Timer not added.\n", startTimeMinutes, stopTimeMinutes);
        return; // Exit if invalid or zero-duration
    }

    timeSlots[numTimeSlots].startTimeMinutes = startTimeMinutes;
    timeSlots[numTimeSlots].stopTimeMinutes = stopTimeMinutes;
    timeSlots[numTimeSlots].active = false; // Ensure new timers are initially inactive
    numTimeSlots++; // Increment numTimeSlots FIRST
    Serial.printf("[DEBUG] numTimeSlots incremented to: %d\n", numTimeSlots);
    Serial.println("[DEBUG] About to save timers in addTimeSlot.");
    saveTimersToPreferences(); // Now save with the updated count
    Serial.printf("Added new timeslot. Total slots: %d. Start: %s, End: %s\n", numTimeSlots, startTimeStr.c_str(), stopTimeStr.c_str());
  } else {
    Serial.println("Maximum number of timers reached. Cannot add new slot.");
  }
}

void deleteTimeSlot(int indexToDelete) {
  if (indexToDelete >= 0 && indexToDelete < numTimeSlots) {
    // Shift the remaining timers to fill the gap
    for (int i = indexToDelete; i < numTimeSlots - 1; i++) {
      timeSlots[i] = timeSlots[i + 1];
    }
    // Mark the last slot as empty
    timeSlots[numTimeSlots - 1].startTimeMinutes = -1;
    timeSlots[numTimeSlots - 1].stopTimeMinutes = -1;
    numTimeSlots--;
    saveTimersToPreferences();
  } else {
    Serial.println("Invalid timer index to delete.");
  }
}



void updateDisplay() {
  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(0, 0);

  if (WiFi.status() == WL_CONNECTED) {
    display.print("IP: ");
    display.println(WiFi.localIP());
    display.print("Time: ");
    display.println(timeClient.getFormattedTime());
    display.setCursor(0, 16); // Move to the second half of the screen

    if (isScheduledMovementActive) {
      display.println("Scheduled movement");
      display.printf("%s - %s", currentScheduleStartTime.c_str(), currentScheduleStopTime.c_str());
    } else if (randomMotionActive) {
      display.println("Random movement");
    } else {
      display.println("Standby");
    }
  } else {
    display.println("WiFi Disconnected");
  }
  display.display();
}

// Function to start a smooth servo movement
/**
 * @brief Initiates a smooth, non-blocking movement for a specified servo.
 * @param servo The Servo object to control.
 * @param movement A reference to the ServoMovement struct tracking this servo's state.
 * @param targetPos The target position (angle) for the servo.
 * @param moveTime The total duration in milliseconds the movement should take.
 */
void startServoMovement(Servo& servo, ServoMovement &movement, int targetPos, int moveTime) {
  movement.startPos = servo.read();
  movement.targetPos = targetPos;
  movement.startTime = millis();
  movement.duration = moveTime;
  movement.isMoving = true;
}

// Function to update servo position smoothly (non-blocking)
/**
 * @brief Updates the position of a servo during a smooth movement.
 * Call this repeatedly in the loop for each servo that might be moving.
 * @param servo The Servo object to control.
 * @param movement A reference to the ServoMovement struct tracking this servo's state.
 */
void updateServoMovement(Servo& servo, ServoMovement &movement) {
  if (movement.isMoving) {
    unsigned long elapsedTime = millis() - movement.startTime;
    if (elapsedTime >= movement.duration) {
      servo.write(movement.targetPos);  // Final position
      movement.isMoving = false; // Stop the movement
    } else {
      float progress = float(elapsedTime) / movement.duration;
      int currentPos = movement.startPos + (movement.targetPos - movement.startPos) * progress;
      servo.write(int(currentPos));
    }
  }
}
// Function to test servo movement by moving it from min to max and back
void testServo(Servo& servo, int minPos, int maxPos) {
  servo.write(minPos);
  delay(1000);  // Wait for movement to complete
  servo.write(maxPos);
}

/**
 * @brief Manages random, non-blocking movements for both servos.
 *
 * When called, if enough time has passed since the last random move (defined by `movementInterval`),
 * it calculates new random target positions for both servos within their configured min/max ranges.
 * It then calculates a movement duration based on the distance to travel and initiates
 * smooth movements using `startServoMovement()`. A new random `movementInterval` is set for the next cycle.
 */
void moveServosRandomlyNonBlocking() {
    unsigned long currentMillis = millis();

    if (currentMillis - lastMotionTime >= movementInterval) {
      lastMotionTime = currentMillis;

