eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
        if (settingsMode) {
          Serial.println("Entering settings mode.");
        } else {
          Serial.println("Exiting settings mode.");
        }
      }

      if (touchDuration2 < 500 && !shortTouchProcessed2) {
        shortTouchProcessed2 = true;
        if (!settingsMode) {
          // Toggle Random Motion
          randomMotionActive = !randomMotionActive;
          if (randomMotionActive) {
            Serial.println("Random motion is now active.");
          } else {
            Serial.println("Random motion is now inactive.");
          }
        } else {
          // Adjust Settings (using both buttons)
          if (touchValue1 < threshold) { // If Touch 1 is also pressed (decrement)
            adjustSettings(currentSetting, false); // Decrement
            Serial.print("Adjusting setting "); Serial.println(currentSetting);
          } else {  // If only Touch 2 is pressed (increment)
            adjustSettings(currentSetting, true); // Increment
            Serial.print("Adjusting setting "); Serial.println(currentSetting);
          }
          currentSetting = (currentSetting + 1) % 4; // Cycle through 0-3
          Serial.print("Next setting to adjust "); Serial.println(currentSetting);
        }
      }
    }
  } else { // Touch is released!
    touchInProgress2 = false;
    shortTouchProcessed2 = false;
    longTouchProcessed2 = false;  // Reset here!
  }
}

/**
 * @brief Main loop of the ESP32 DevKitV1 application.
 *
 * This function is executed repeatedly and handles the core logic:
 * - Handles ArduinoOTA updates.
 * - Processes WebSocket client events and reconnection logic.
 * - Reads touch pin inputs for sleep/wake and settings adjustment.
 * - Manages scheduled movements based on NTP time and configured time slots.
 * - Controls random servo movements if enabled (either by schedule or manual toggle).
 * - Updates servo positions for smooth, non-blocking movements.
 * - Updates the OLED display based on current mode (normal, settings) and status.
 * - Sends periodic status updates to the WebSocket server.
 * - Handles serial communication with the ESP32CAM (receiving status, sending commands).
 * - Manages WiFi connection using WiFiManager, attempting to reconnect if disconnected.
 * - Forwards commands received via main Serial to the ESP32CAM via Serial2.
 * - Periodically updates NTP time.
 */
void loop() {
  ArduinoOTA.handle();
  webSocket.loop();
  readTouch();

  if (!webSocketConnected && WiFi.status() == WL_CONNECTED) {
    if (millis() - webSocketLastReconnectAttempt > webSocketReconnectInterval) {
      webSocketLastReconnectAttempt = millis();
      Serial.println("Attempting to reconnect WebSocket...");
      // webSocket.begin() should ideally handle reconnection attempts if using setReconnectInterval
      // but an explicit begin call might be needed if the initial connection fails repeatedly.
      // For now, rely on setReconnectInterval and internal handling.
      // If connection drops, the library should try to reconnect.
      // If initial connect fails, this might need an explicit webSocket.connect(host,port,path) or begin again.
      // Let's assume library handles reconnects for now. If not, add explicit webSocket.connect() here.
    }
  }

  bool shouldMoveRandomlyThisCycle = false;
  String scheduledStartTime = ""; // Local variables to store the times
  String scheduledStopTime = "";

  if (timeClient.isTimeSet()) {
    String fullTime = getFormattedTime(); // This is HH:MM:SS
    String currentTimeForLogic = fullTime.substring(0, 5); // Should be HH:MM

    // Ensure NTP debug log is commented or removed
    // Serial.printf("[DEBUG] Full NTP time: %s, Truncated for logic: %s\n", fullTime.c_str(), currentTimeForLogic.c_str());

    int currentMinutes = timeToMinutes(currentTimeForLogic);

    if (currentMinutes == -1) { // timeToMinutes might return -1 if time is not set or format is wrong
        Serial.println("Cannot check schedule, current time is invalid.");
    } else {
        for (int i = 0; i < numTimeSlots; i++) {
            // Explicitly skip if timer slot data is invalid (should be ensured by loading logic too)
            if (timeSlots[i].startTimeMinutes == -1 || timeSlots[i].stopTimeMinutes == -1) {
                continue;
            }

            // Check if current time falls within this time slot
            if (timeSlots[i].startTimeMinutes < timeSlots[i].stopTimeMinutes) { // Normal case (e.g., 10:00 - 12:00)
                if (currentMinutes >= timeSlots[i].startTimeMinutes && currentMinutes < timeSlots[i].stopTimeMinutes) {
                    shouldMoveRandomlyThisCycle = true;
                    scheduledStartTime = minutesToTime(timeSlots[i].startTimeMinutes);
                    scheduledStopTime = minutesToTime(timeSlots[i].stopTimeMinutes);
                    break;
                }
            } else { // Overnight case (e.g., 22:00 - 02:00)
                if (currentMinutes >= timeSlots[i].startTimeMinutes || currentMinutes < timeSlots[i].stopTimeMinutes) {
                    shouldMoveRandomlyThisCycle = true;
                    scheduledStartTime = minutesToTime(timeSlots[i].startTimeMinutes);
                    scheduledStopTime = minutesToTime(timeSlots[i].stopTimeMinutes);
                    break;
                }
            }
        }
    }
  }

  isScheduledMovementActive = shouldMoveRandomlyThisCycle; // Update the global state
  if (isScheduledMovementActive) {
    // Ensure that currentScheduleStartTime and currentScheduleStopTime are not "N/A" before using them
    if (scheduledStartTime != "N/A" && scheduledStopTime != "N/A") {
        currentScheduleStartTime = scheduledStartTime; // Update the global start time
        currentScheduleStopTime = scheduledStopTime;   // Update the global stop time
        turnLaserOn();
    } else {
        // This case should ideally not be reached if shouldMoveRandomlyThisCycle is true
        // because minutesToTime should have provided valid strings.
        // But as a safeguard:
        isScheduledMovementActive = false; // Correct the state if times are N/A
        currentScheduleStartTime = "";
        currentScheduleStopTime = "";
    }
  } else {
    currentScheduleStartTime = ""; // Clear the global start time when no schedule is active
    currentScheduleStopTime = "";   // Clear the global stop time when no schedule is active
  }

